#include <stdio.h>

/*
ТУЕС
11 А
17
Мартин Красимиров Кирилов
Да се разработи програма, която изисква от потребителя да въведе целочислено число х, където 0<x<10. 
Да се инициализира масив от 10 елемента. Да се намери сумата от cos(z) за всяко z в интервала [0;x) 
и да се запише като първи елемент в масива. Да се намери сумата от cos(z) за всяко z в интервала [x; 2x) 
и да се запише като втори елемент в масива. Аналогично да се намерят сумите на cos(z) 
за всички интервали [Nx; (N+1)x ) и да се запишат като елемент N в масива за всяко N в интервала [0, 10). 
Масивът да се изведе на стандартния изход.
*/

int main() {
    int x;
    float arr[10];
    int i;
    int N;
    float sum;
    
    do {
        printf("Enter x : \n");
        scanf("%d", &x);   
    }while(!((x > 0) && (x < 10)));
    
    for(N = 0; N < 10; N++) {
        sum = 0.0;
        
        for(i = N*x; i < (N+1)*x; i++) {
            sum += cos(i);
        }
        
        arr[N] = sum;
    }
    
    for(i = 0; i < 10; i++) {
        printf("Arr[%d] = %f\n", i+1, arr[i]);
    }
    
    getch();
    
    return 0;   
}
