/*
Технологично училище „Електронни системи” http://www.elsys-bg.org/
11 А
17
Мартин Красимиров Кирилов
Да се разработи програма, която изисква от потребителя да въведе целочислено число x, където 0<x<10. 
Да се инициализира масив от 10 елемента. Да се намери първото число N в интервала [0; +∞) делящо се на х. 
Да се намери сумата на всички числа в интервала [0; N] и да се запише като първи елемент в масива. 
Да се намери второто число N' в интервала [0; +∞) делящо се на x. 
Да се намери сумата на всички числа в интервала [0, N'] и да се запише като втори елемент в масива. 
Аналогично да се запълнят и останалите елементи на масива. Масивът да се изведе на стандартния изход.
*/

#include <stdio.h>

int main() {
    int x;
    int arr[10];
    int sum = 0;
    int currN = 1;
    int i, j;
    int N = 1;
    
    
    do {
        printf("Enter x : \n");
        scanf("%d", &x);   
    }while(!(x > 0) && (x < 10));
    
    for(i = 0; i < 10; i++) {
        while(1) {
            ++N;
            if((N % x == 0) && (N > currN)) {
                for(j = 0; j <= N; j++) {
                    sum += j;
                    currN = N;  
                }
                arr[i] = sum;
                sum = 0;
                break;
                
            }
            
        }
    }
    
    for(i = 0; i < 10; i++) {
    printf("Arr[%d] = %d\n", i+1, arr[i]);   
    }
    
    getch();
    
    return 0;
}
