/*
Технологично училище „Електронни системи” http://www.elsys-bg.org/
11 А
17
Мартин Красимиров Кирилов
Да се разработи програма, която изисква от потребителя да въведе целочислено число x, където 0<x<10. 
Да се инициализира масив от 10 елемента. Да се намери сумата от всички числа в интервала [0; 1000) делящи се на x 
и да се запише като първа стойност в масива. Да се намери сумата от всички числа в интервала [0;1000) деляща се на 2x
и да се запише като втора стойност в масива. Аналогично да се намери сумата на всички числа делящи се на
Nx за N в интервала [1;10] и да се запишат като елемент N-1 в масива. Масивът да се изведе на стандартния изход.
*/

#include <stdio.h>

int main() {
    int x;
    int arr[10];
    int sum = 0;
    int N = 1;
    int i;
    
    do {
        printf("Enter x : \n");
        scanf("%d", &x);   
    }while(!(x > 0) && (x < 10));
    
    for(N = 0; N < 10; N++) {
        sum = 0;
        for(i = 0; i < 1000; i++) {
            if(i % ((N+1)*x) == 0) {
                sum += i;   
            }   
        }
        arr[N] = sum;
    }
    
    for(i = 0; i < 10; i++) {
    printf("Arr[%d] = %d\n", i+1, arr[i]);   
    }
    
    getch();
    
    return 0;
}

