#include <stdio.h>

/*
ТУЕС
11 А
17
Мартин Красимиров Кирилов
Да се разработи програма, която изисква от потребителя да въведе целочислено число x, където 0<x<10. 
Да се инициализира масив от 10 елемента. Да се намери първото просто число в интервала [0; +∞) завършващо на x 
и да се запише като първи елемент в масива. Да се намери второто просто число в интервала [0;  +∞) завършващо на x 
и да се запише като втори елемент в масива. Аналогично да се намерят първите N прости числа в интервала [0;  +∞) 
и да се запишат като елемент N в масива. Масивът да се изведе на стандартния изход.
*/

int isPrime(int num);

int main() {
    int x;
    int arr[10];
    int N;
    int i = 3;
    int cyc = 1;
    
    do {
        printf("Enter x : \n");
        scanf("%d", &x);   
    }while(!((x > 0) && (x < 10)));
    
    for(N = 0; N < 10; N++) {
        cyc = 1;
        while(cyc) {
            i++;
            if(isPrime(i)) {
                if(i % 10 == x) {
                    arr[N] = i;
                    cyc = 0;
                }   
            }
        }
        
    }
    
    for(i = 0; i < 10; i++) {
    printf("Arr[%d] = %d\n", i+1, arr[i]);   
    }
    
    getch();
    
    return 0;
}

int isPrime(int num) {
    int i, n;
    int isPr;
    for(i = 3; i <= num; i++) {
        isPr = 1;
        for(n = 2; n < i; n++) {
            if(i % n == 0){
                isPr = 0;
            } 
        }
    }
    return isPr;
}
