/*
Технологично училище „Електронни системи” http://www.elsys-bg.org/
11 А
17
Мартин Красимиров Кирилов
Да се разработи програма, която изисква от потребителя да въведе целочислено число x, където 0<x<10. 
Да се инициализира масив от 10 елемента. Да се намери първото число на Фибоначи в интервала [0; +∞) завършващо на x 
и да се запише като първи елемент в масива. Да се намери второто число на Фибоначи в интервала [0;  +∞) завършващо на x 
и да се запише като втори елемент в масива. Аналогично да се намерят първите N прости числа в интервала [0;  +∞) 
и да се запишат като елемент N в масива. Масивът да се изведе на стандартния изход.
*/

#include <stdio.h>

int main() {
    int x;
    long long arr[10];
    int N;
    int i;
    long long first = 1;
    long long second = 1;
    long long next;
    
    do {
        printf("Enter x : \n");
        scanf("%d", &x);   
    }while(!((x > 0) && (x < 10)));
    
    for(N = 0; N < 10; N++) {
        while(1) {
            next = first + second;
            first = second;
            second = next;
            if(second % 10 == x) {
                arr[N] = second;
                break;
            }
        }
    }
    
    for(i = 0; i < 10; i++) {
        printf("Arr[%d] = %d\n", i+1, arr[i]);   
    }
    
    getch();
    
    return 0;   
}
