#include <stdio.h>

/*
ТУЕС
11 А
17
Мартин Красимиров Кирилов
Да се разработи програма, която изисква от потребителя да въведе целочислено число x, където 0<=x<10.
Да се инициализира масив от 10 елемента. Да се намерят първите 10 стойности на функцията cos(x) 
в интервала [0; +∞), в които третата цифра след десетичната запетая е x. 
Пример при cos(1) = 0.540302306 третата цифра след десетичната запетая е 0. 
При cos(2) = -0.416146837 третата цифра след десетичната запетая е 6. 
Намерените стойности да се зададат като стойности на елементите в масива. 
Елементите на масива да се изведат на стандартния изход.
*/

int main() {
    int x;
    int arrLength = 10;
    float arr[arrLength];
    int count = 0;
    int i = 0;
    float temp;
    
    do{
        printf("Enter x: \n");
        scanf("%d", &x);
    }while(!((x > 0) && (x <= 10)));
    
    while(count < 10) {
        temp = cos(i);
        i++;
        if((int)(temp * 1000) % 10 == x) {
            arr[count] = temp;
            count++;
        }
        i++;
    }

    for(i = 1; i <= arrLength; i++) {
        printf("Element %d : %f\n", i, arr[i]);   
    }
    
    getch();
    return 0;   
}
